Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-MC_DFP/1.0.32/Microchip.PIC32CM-MC_DFP.pdsc
      <condition id="PIC32CM1216MC00032">
         <require Dvendor="Microchip:3" Dname="PIC32CM1216MC00032"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM6408MC00048">
         <require Dvendor="Microchip:3" Dname="PIC32CM6408MC00048"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM6408MC00032">
         <require Dvendor="Microchip:3" Dname="PIC32CM6408MC00032"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="PIC32CM1216MC00048">
         <description>Headers and startup code for Microchip PIC32CM1216MC00048</description>
         <files>
            <file condition="C" category="include" name="include/"/>
            <file condition="C" category="header" name="include/pic32c.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_pic32cm1216mc00048.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_pic32cm1216mc00048.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/pic32cm1216mc00048_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/pic32cm1216mc00048_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_pic32cm1216mc00048.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_pic32cm1216mc00048.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_pic32cm1216mc00048.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_pic32cm1216mc00048.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/pic32cm1216mc00048/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/pic32cm1216mc00048/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="PIC32CM1216MC00032">
         <description>Headers and startup code for Microchip PIC32CM1216MC00032</description>
         <files>
            <file condition="C" category="include" name="include/"/>
            <file condition="C" category="header" name="include/pic32c.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_pic32cm1216mc00032.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_pic32cm1216mc00032.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/pic32cm1216mc00032_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/pic32cm1216mc00032_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_pic32cm1216mc00032.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_pic32cm1216mc00032.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_pic32cm1216mc00032.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_pic32cm1216mc00032.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/pic32cm1216mc00032/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/pic32cm1216mc00032/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="PIC32CM6408MC00048">
         <description>Headers and startup code for Microchip PIC32CM6408MC00048</description>
         <files>
            <file condition="C" category="include" name="include/"/>
            <file condition="C" category="header" name="include/pic32c.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_pic32cm6408mc00048.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_pic32cm6408mc00048.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/pic32cm6408mc00048_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/pic32cm6408mc00048_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_pic32cm6408mc00048.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_pic32cm6408mc00048.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_pic32cm6408mc00048.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_pic32cm6408mc00048.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/pic32cm6408mc00048/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/pic32cm6408mc00048/flash.icf" attr="config"/>
         </files>
      </component>
